app/Controllers/Announcement.php

    public function index()
    {
        // Fetch all announcements ordered by created_at DESC
        $announcements = $this->announcementModel
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC